#include <stdio.h>

/*
一个人，一天，成纺织 5米


一天要1000米布   200人一起工作  一人的工资一天10块钱   2000块人力成本


一个机器，一天可以纺织 1000米   
20人研发一个机器

*/

/*
学生（语数外）成绩管理系统

学生姓名、语文成绩、数学成绩、英语成绩  放到一个变量中

1---添加学生成绩
2---删除学生成绩
3---显示所有学生成绩

4---业务1：所有总分不及格的学生（小于180）
5---业务2：每一科都不及格的学生
6---业务3：显示总分最高的学生（这个业务有bug，如果有多个人总分最高，那么随机显示一个即可）
7---业务4：显示平均分最高，且没有不及格科目的学生

*/



struct Student
{
    int yuwen;
    int shuxue;
    int yingyu;
    char name[100];
};


int main(){

    printf("学生成绩管理系统\n");

    
    while(1){
        printf("1---添加学生成绩\n");
        printf("2---删除学生成绩\n");
        printf("3---显示所有学生成绩\n");
        printf("4---业务1：所有总分不及格的学生（小于180）\n");
        printf("5---业务2：每一科都不及格的学生\n");
        printf("6---业务3：显示总分最高的学生\n");
        printf("7---业务4：显示平均分最高，且没有不及格科目的学生\n");
        printf("8---退出\n");

        printf("请选择:\n");

        int code;
        scanf("%d",&code);

        if(code == 1){

        }
        if(code == 2){
            
        }
        if(code == 3){
            
        }
        if(code == 4){
            
        }
        if(code == 5){
            
        }
        if(code == 6){
            
        }
        if(code == 7){
            
        }
        if(code == 8){
            printf("程序退出\n");
            break;
        }

    }
    



    return 0;

}